{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.19.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d/kernel", "shape": [5, 5, 3, 35], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [35], "dtype": "float32"}, {"name": "p_re_lu/alpha", "shape": [1, 1, 35], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [1, 1, 35, 5], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [5], "dtype": "float32"}, {"name": "p_re_lu_1/alpha", "shape": [1, 1, 5], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 5, 5], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [5], "dtype": "float32"}, {"name": "p_re_lu_2/alpha", "shape": [1, 1, 5], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [1, 1, 5, 35], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [35], "dtype": "float32"}, {"name": "p_re_lu_3/alpha", "shape": [1, 1, 35], "dtype": "float32"}, {"name": "conv2d_transpose/kernel", "shape": [9, 9, 3, 35], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [3], "dtype": "float32"}]}]}